base/Catalogs/бит_му_НастройкиРазнесенияСальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_му_НастройкиРазнесенияСальдо</Name>
			<Comment>(БИТ МУ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Разнесение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетАП</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетА</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетП</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.бит_Дополнительный_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДетализации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_му_НастройкиРазнесенияСальдо/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте 
Перем мСчетАП; // Хранит текущие значения Счета А/П.

&НаКлиенте 
Перем мСчетА; // Хранит текущие значения Счета А.

&НаКлиенте 
Перем мСчетП; // Хранит текущие значения Счета П.
        
#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Изменение кода. Начало. 03.04.2014{{
	УстановитьПараметрыВыбораДляСчетов();
    // Изменение кода. Конец. 03.04.2014}}

КонецПроцедуры
  
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРазнесение

&НаКлиенте
Процедура РазнесениеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;
	УровеньДтл    = 4;
	
	НоваяСтрока = Объект.Разнесение.Добавить();
	
	Если Копирование Тогда
				
		НоваяСтрока.СчетА 			   = ТекущиеДанные.СчетА;
		НоваяСтрока.СчетП 			   = ТекущиеДанные.СчетП;
		НоваяСтрока.УровеньДетализации = ТекущиеДанные.УровеньДетализации;
			
	Иначе
				
		НоваяСтрока.УровеньДетализации = УровеньДтл;
	
	КонецЕсли;
	
	Элементы.Разнесение.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
	мСчетАП = НоваяСтрока.СчетАП;
	мСчетА  = НоваяСтрока.СчетА;
	мСчетП  = НоваяСтрока.СчетП;
	
КонецПроцедуры // РазнесениеПередНачаломДобавления()

&НаКлиенте
Процедура РазнесениеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	мСчетАП = ТекущиеДанные.СчетАП;
	мСчетА  = ТекущиеДанные.СчетА;
	мСчетП  = ТекущиеДанные.СчетП; 	
	
КонецПроцедуры // РазнесениеПриНачалеРедактирования()

&НаКлиенте
Процедура РазнесениеСчетАПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;	
	мСчетАП = ТекущиеДанные.СчетАП;
	
	ОткрытьФормуВыбораСчета(Элемент, ВидСчета.АктивноПассивный);	
	
КонецПроцедуры // РазнесениеСчетАПНачалоВыбора()

&НаКлиенте
Процедура РазнесениеСчетАППриИзменении(Элемент)
	   	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;	
	Ид = ТекущиеДанные.ПолучитьИдентификатор();
	Отказ = Ложь;
	
	Если Не СчетКорректен(ТекущиеДанные.СчетАП, ВидСчета.АктивноПассивный, Ид) Тогда   		
		ТекстСообщения = НСтр("ru='Ошибка выбора счета. Счет А/П должен быть активно-пассивным и не забалансовым, а также должны совпадать признаки валютного учета у всех счетов в строке.';
							  |en='account determination error. Score A / P must be an active-passive and off-balance sheet, as well as signs of currency must be the same account for all accounts in line.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);    		
		Отказ = Истина; 			
	КонецЕсли;
	
	Для каждого СтрокаТабл Из Объект.Разнесение Цикл
		
		Если СтрокаТабл.ПолучитьИдентификатор() <> Ид И СтрокаТабл.СчетАП = ТекущиеДанные.СчетАП Тогда 
			НомСтр  = Строка(СтрокаТабл.НомерСтроки);
			СчетСтр = Строка(СтрокаТабл.СчетАП);
			ТекстСообщения = НСтр("ru='Ошибка выбора счета. Значение %1 уже подобрано в строке №%2.';
								  |en='account determination error. The %1 already matched in the line №%2.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, СчетСтр, НомСтр);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина; 				 						
		КонецЕсли; 	
		
	КонецЦикла;
	
	Если Отказ Тогда 	
		ТекущиеДанные.СчетАП = мСчетАП;  	
	КонецЕсли;
	
КонецПроцедуры // РазнесениеСчетАППриИзменении()

&НаКлиенте
Процедура РазнесениеСчетАНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;	
	мСчетА = ТекущиеДанные.СчетА;
	
	ОткрытьФормуВыбораСчета(Элемент, ВидСчета.Активный);
	
КонецПроцедуры // РазнесениеСчетАНачалоВыбора()

&НаКлиенте
Процедура РазнесениеСчетАПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;
	Ид = ТекущиеДанные.ПолучитьИдентификатор();
	
	Если Не СчетКорректен(ТекущиеДанные.СчетА, ВидСчета.Активный, Ид) Тогда		
		ТекстСообщения = НСтр("ru='Ошибка выбора счета. Счет А должен быть активным и не забалансовым, а также должны совпадать признаки валютного учета у всех счетов в строке.';
							  |en='Account determination error. And the expense is to be active and no off-balance sheet and should also be the same signs of currency account for all accounts in line.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		ТекущиеДанные.СчетА = мСчетА;		
	КонецЕсли;
	
КонецПроцедуры // РазнесениеСчетАПриИзменении()

&НаКлиенте
Процедура РазнесениеСчетПНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;	
	мСчетП = ТекущиеДанные.СчетП;
	
	ОткрытьФормуВыбораСчета(Элемент, ВидСчета.Пассивный);
	
КонецПроцедуры // РазнесениеСчетПНачалоВыбора()

&НаКлиенте
Процедура РазнесениеСчетППриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Разнесение.ТекущиеДанные;
	Ид = ТекущиеДанные.ПолучитьИдентификатор();
	
	Если Не СчетКорректен(ТекущиеДанные.СчетП, ВидСчета.Пассивный, Ид) Тогда		
		ТекстСообщения = НСтр("ru='Ошибка выбора счета. Счет П должен быть пассивным и не забалансовым, а также должны совпадать признаки валютного учета у всех счетов в строке.';
							  |en='Account determination error. Account II to be passive and not off-balance sheet, as well as signs must match the currency of accounting for all accounts in line.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		ТекущиеДанные.СчетП = мСчетП;		
	КонецЕсли;
	
КонецПроцедуры // РазнесениеСчетППриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СчетКорректен(Счет, Вид, Ид)

	СчетКорректен = Истина;
	
	Если ЗначениеЗаполнено(Счет) Тогда
        
        СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
        
		Если (СвСч.Вид <> Вид ИЛИ СвСч.Забалансовый) Тогда	
            
            СчетКорректен = Ложь;			
            
        Иначе
            
            ТекущиеДанные = Объект.Разнесение.НайтиПоИдентификатору(Ид);
        		
            Если ЗначениеЗаполнено(ТекущиеДанные.СчетАП) Тогда
                СвСчАП = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетАП);
    			ВалютныйСчет = СвСчАП.Валютный;
            КонецЕсли;
            
            Если ЗначениеЗаполнено(ТекущиеДанные.СчетА) Тогда
                СвСчА = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетА);
    			Если ВалютныйСчет = Неопределено Тогда
    				ВалютныйСчет = СвСчА.Валютный;
    			ИначеЕсли ВалютныйСчет <> СвСчА.Валютный Тогда
    				СчетКорректен = Ложь;
    			КонецЕсли;
            КонецЕсли;
            
            Если ЗначениеЗаполнено(ТекущиеДанные.СчетП) Тогда
                СвСчП = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(ТекущиеДанные.СчетП);
    			Если ВалютныйСчет <> СвСчП.Валютный Тогда
    				СчетКорректен = Ложь;
    			КонецЕсли;
            КонецЕсли;
        
        КонецЕсли;				
			
	КонецЕсли;

	Возврат СчетКорректен;
	
КонецФункции // СчетКорректен() 

// Процедура устанвливает параметры выбора для элементов формы. 
// 
// Параметры:
//  МассивЭлементов - Массив.
// 
&НаСервере
Процедура УстановитьПараметрыВыбораДляСчетов()

	МассивЭлементов = Новый Массив;
	МассивЭлементов.Добавить(Элементы.РазнесениеСчетАП);
	МассивЭлементов.Добавить(Элементы.РазнесениеСчетА);
	МассивЭлементов.Добавить(Элементы.РазнесениеСчетП);
	
	бит_РаботаСДиалогамиСервер.УстановитьПараметрыВыбораДляЭлементов(МассивЭлементов);
	
КонецПроцедуры // УстановитьПараметрыВыбораДляСчетов() 

&НаКлиенте
Процедура ОткрытьФормуВыбораСчета(Элемент, Вид)

	Отбор = Новый Структура;
	Отбор.Вставить("Вид"		 , Вид);
	Отбор.Вставить("Забалансовый", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("ПланСчетов.бит_Дополнительный_2.Форма.ФормаВыбора", 
						ПараметрыФормы, Элемент);	

КонецПроцедуры // ОткрытьФормуВыбораСчета()

#КонецОбласти
